[
    {
        "role": "Senior Specialty Systems Operations Engineer",
        "company": "Wells Fargo Securities",
        "summary": "\n- Developed and implemented a comprehensive monitoring solution using ITRS/Geneos to track internal ETL/batch processes, server processes on Windows/Linux, and database statistics, ensuring optimal system performance and rapid issue detection.\n- Collaborated closely with software developers and database administrators (DBAs) to resolve technical issues, enhancing system reliability and performance. \n- Utilized ServiceNow for effective incident management, change requests, and addressing day-to-day user requests, maintaining high service standards and user satisfaction. \n- Assisted with infrastructure updates, addressing vulnerabilities, technology refreshes, and migrating applications to new hardware to ensure system security and up-to-date technology stack. \n- Provided robust support for all production deployments, ensuring smooth transitions and minimal downtime. \n- Planned and coordinated disaster recovery events for applications, ensuring business continuity and adherence to recovery SLAs. \n- Utilized Terraform to apply infrastructure changes for a web application hosted on Azure cloud, ensuring efficient and reliable cloud infrastructure management.",
        "range": "August 2022 - Present"
    },
    {
        "role":"Senior Infrastructure Engineer",
        "company":"Wells Fargo Advisors",
        "summary":"\n- Acted as the subject matter expert for IBM BPM application and infrastructure, ensuring optimal performance and reliability. \n- Led the adoption of Jira Service Desk, streamlining user interactions, improving issue tracking and resolution, and providing management with insights into team workload and performance. \n- Coordinated and executed disaster recovery events, ensuring business continuity and adherence to recovery SLAs. \n- Managed and executed version upgrades for lower and production environments, ensuring systems were up-to-date and secure. \n- Developed and maintained run books and standard operating procedures for troubleshooting and resolving issues. \n- Conducted root cause analysis meetings, collaborating with cross-functional teams to resolve complex infrastructure and application issues. \n- Revised and improved monitoring solutions using Splunk and AppDynamics, enhancing error detection and system health monitoring. \n- Assisted with production deployments, ensuring smooth transitions and minimal downtime. \n- Worked closely with vendors to troubleshoot and resolve complex issues, maintaining strong vendor relationships.",
        "range":"February 2019 - August 2022"
    },
    {
        "role":"Applications Systems Engineer",
        "company":"Wells Fargo Advisors",
        "summary":"\n- Maintained IBM BPM environments on IBM WebSphere Application Server, supporting development, integrated test, performance, and user acceptance test environments, as well as production environments. \n- Developed Splunk dashboards to monitor JVM activity, detect errors (e.g., deadlocks, Out of Memory Errors, Java Heap Space errors), and alert on application-specific issues. \n- Created AppDynamics dashboards and alerts to monitor server health and proactively detect issues. \n- Collaborated with software developers, DBAs, and IBM engineers to resolve complex infrastructure and application issues, ensuring system stability and performance. \n- Automated server management tasks by creating bash scripts for JVM restarts, node agent synchronization, and other routine maintenance activities, reducing manual intervention and increasing efficiency. \n- Attended root cause analysis meetings to identify and resolve the underlying causes of system issues and outages.\n- Assisted with production deployments, ensuring smooth implementation and minimal disruption. \n-Maintained and updated run books and standard operating procedures to provide clear guidance for issue resolution and system management.",
        "range":"April 2017 - February 2019"
    },
    {
        "role":"Systems QA Analyst",
        "company":"Wells Fargo Securities",
        "summary":"\n- Ensured testing environments were properly configured and maintained with the latest data and updates. \n- Performed regression testing for all derivative products (e.g., swaps, credit default swaps, swaptions), running test suites and analyzing results. \n- Identified and resolved issues or discrepancies in regression testing by collaborating with software developers. \n- Conducted functional testing for bug fixes reported by business users, coordinating with developers and reporting findings. \n-Worked with production support teams to document standard operating procedures for processes entering production from bug fixes.",
        "range":"June 2012 - April 2017"
    }
]
